#!/usr/bin/env bash
echo "推送环境:${ENV}"

# 切换nodejs版本
nvm use 10.16.2

# 依赖安装
npm install
if [ $? -eq 0 ];then
    echo "============================================="
    echo "依赖安装成功!"
    echo "============================================="
else
    echo "============================================="
    echo "依赖安装失败!"
    echo "============================================="
    exit 1;
fi

# 资源编译
npm run build
if [ $? -eq 0 ];then
    echo "============================================="
    echo "资源编译成功!"
    echo `date +%s` > ./md5
    echo `date +%s` > ./release
    echo "============================================="
else
    echo "============================================="
    echo "资源编译失败!"
    echo "============================================="
    exit 1;
fi
# 开启服务
npm run start



